MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA310/mcu.h
#define _PORTG_RG14_POSITION                     0x0000000E
#define _PORTG_RG14_MASK                         0x00004000
#define _PORTG_RG14_LENGTH                       0x00000001

#define _PORTG_RG15_POSITION                     0x0000000F
#define _PORTG_RG15_MASK                         0x00008000
#define _PORTG_RG15_LENGTH                       0x00000001

#define _LATG_LATG0_POSITION                     0x00000000
#define _LATG_LATG0_MASK                         0x00000001
#define _LATG_LATG0_LENGTH                       0x00000001

#define _LATG_LATG1_POSITION                     0x00000001
#define _LATG_LATG1_MASK                         0x00000002
#define _LATG_LATG1_LENGTH                       0x00000001

#define _LATG_LATG2_POSITION                     0x00000002
#define _LATG_LATG2_MASK                         0x00000004
#define _LATG_LATG2_LENGTH                       0x00000001

#define _LATG_LATG3_POSITION                     0x00000003
#define _LATG_LATG3_MASK                         0x00000008
#define _LATG_LATG3_LENGTH                       0x00000001

#define _LATG_LATG6_POSITION                     0x00000006
#define _LATG_LATG6_MASK                         0x00000040
#define _LATG_LATG6_LENGTH                       0x00000001

#define _LATG_LATG7_POSITION                     0x00000007
#define _LATG_LATG7_MASK                         0x00000080
#define _LATG_LATG7_LENGTH                       0x00000001

#define _LATG_LATG8_POSITION                     0x00000008
#define _LATG_LATG8_MASK                         0x00000100
#define _LATG_LATG8_LENGTH                       0x00000001

#define _LATG_LATG9_POSITION                     0x00000009
#define _LATG_LATG9_MASK                         0x00000200
#define _LATG_LATG9_LENGTH                       0x00000001

#define _LATG_LATG12_POSITION                    0x0000000C
#define _LATG_LATG12_MASK                        0x00001000
#define _LATG_LATG12_LENGTH                      0x00000001

#define _LATG_LATG13_POSITION                    0x0000000D
#define _LATG_LATG13_MASK                        0x00002000
#define _LATG_LATG13_LENGTH                      0x00000001

#define _LATG_LATG14_POSITION                    0x0000000E
#define _LATG_LATG14_MASK                        0x00004000
#define _LATG_LATG14_LENGTH                      0x00000001

#define _LATG_LATG15_POSITION                    0x0000000F
#define _LATG_LATG15_MASK                        0x00008000
#define _LATG_LATG15_LENGTH                      0x00000001

#define _ODCG_ODG0_POSITION                      0x00000000
#define _ODCG_ODG0_MASK                          0x00000001
#define _ODCG_ODG0_LENGTH                        0x00000001

#define _ODCG_ODG1_POSITION                      0x00000001
#define _ODCG_ODG1_MASK                          0x00000002
#define _ODCG_ODG1_LENGTH                        0x00000001

#define _ODCG_ODG2_POSITION                      0x00000002
#define _ODCG_ODG2_MASK                          0x00000004
#define _ODCG_ODG2_LENGTH                        0x00000001

#define _ODCG_ODG3_POSITION                      0x00000003
#define _ODCG_ODG3_MASK                          0x00000008
#define _ODCG_ODG3_LENGTH                        0x00000001

#define _ODCG_ODG6_POSITION                      0x00000006
#define _ODCG_ODG6_MASK                          0x00000040
#define _ODCG_ODG6_LENGTH                        0x00000001

#define _ODCG_ODG7_POSITION                      0x00000007
#define _ODCG_ODG7_MASK                          0x00000080
#define _ODCG_ODG7_LENGTH                        0x00000001

#define _ODCG_ODG8_POSITION                      0x00000008
#define _ODCG_ODG8_MASK                          0x00000100
#define _ODCG_ODG8_LENGTH                        0x00000001

#define _ODCG_ODG9_POSITION                      0x00000009
#define _ODCG_ODG9_MASK                          0x00000200
#define _ODCG_ODG9_LENGTH                        0x00000001

#define _ODCG_ODG12_POSITION                     0x0000000C
#define _ODCG_ODG12_MASK                         0x00001000
#define _ODCG_ODG12_LENGTH                       0x00000001

#define _ODCG_ODG13_POSITION                     0x0000000D
#define _ODCG_ODG13_MASK                         0x00002000
#define _ODCG_ODG13_LENGTH                       0x00000001

#define _ODCG_ODG14_POSITION                     0x0000000E
#define _ODCG_ODG14_MASK                         0x00004000
#define _ODCG_ODG14_LENGTH                       0x00000001

#define _ODCG_ODG15_POSITION                     0x0000000F
#define _ODCG_ODG15_MASK                         0x00008000
#define _ODCG_ODG15_LENGTH                       0x00000001

#define _PADCFG1_PMPTTL_POSITION                 0x00000000
#define _PADCFG1_PMPTTL_MASK                     0x00000001
#define _PADCFG1_PMPTTL_LENGTH                   0x00000001

#define _AD1CON1_DONE_POSITION                   0x00000000
#define _AD1CON1_DONE_MASK                       0x00000001
#define _AD1CON1_DONE_LENGTH                     0x00000001

#define _AD1CON1_SAMP_POSITION                   0x00000001
#define _AD1CON1_SAMP_MASK                       0x00000002
#define _AD1CON1_SAMP_LENGTH                     0x00000001

#define _AD1CON1_ASAM_POSITION                   0x00000002
#define _AD1CON1_ASAM_MASK                       0x00000004
#define _AD1CON1_ASAM_LENGTH                     0x00000001

#define _AD1CON1_SSRC_POSITION                   0x00000004
#define _AD1CON1_SSRC_MASK                       0x000000F0
#define _AD1CON1_SSRC_LENGTH                     0x00000004

#define _AD1CON1_FORM_POSITION                   0x00000008
#define _AD1CON1_FORM_MASK                       0x00000300
#define _AD1CON1_FORM_LENGTH                     0x00000002

#define _AD1CON1_MODE12_POSITION                 0x0000000A
#define _AD1CON1_MODE12_MASK                     0x00000400
#define _AD1CON1_MODE12_LENGTH                   0x00000001

#define _AD1CON1_DMAEN_POSITION                  0x0000000B
#define _AD1CON1_DMAEN_MASK                      0x00000800
#define _AD1CON1_DMAEN_LENGTH                    0x00000001

