MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA310/mcu.h
#define _PMCON4_PTEN7_POSITION                   0x00000007
#define _PMCON4_PTEN7_MASK                       0x00000080
#define _PMCON4_PTEN7_LENGTH                     0x00000001

#define _PMCON4_PTEN8_POSITION                   0x00000008
#define _PMCON4_PTEN8_MASK                       0x00000100
#define _PMCON4_PTEN8_LENGTH                     0x00000001

#define _PMCON4_PTEN9_POSITION                   0x00000009
#define _PMCON4_PTEN9_MASK                       0x00000200
#define _PMCON4_PTEN9_LENGTH                     0x00000001

#define _PMCON4_PTEN10_POSITION                  0x0000000A
#define _PMCON4_PTEN10_MASK                      0x00000400
#define _PMCON4_PTEN10_LENGTH                    0x00000001

#define _PMCON4_PTEN11_POSITION                  0x0000000B
#define _PMCON4_PTEN11_MASK                      0x00000800
#define _PMCON4_PTEN11_LENGTH                    0x00000001

#define _PMCON4_PTEN12_POSITION                  0x0000000C
#define _PMCON4_PTEN12_MASK                      0x00001000
#define _PMCON4_PTEN12_LENGTH                    0x00000001

#define _PMCON4_PTEN13_POSITION                  0x0000000D
#define _PMCON4_PTEN13_MASK                      0x00002000
#define _PMCON4_PTEN13_LENGTH                    0x00000001

#define _PMCON4_PTEN14_POSITION                  0x0000000E
#define _PMCON4_PTEN14_MASK                      0x00004000
#define _PMCON4_PTEN14_LENGTH                    0x00000001

#define _PMCON4_PTEN15_POSITION                  0x0000000F
#define _PMCON4_PTEN15_MASK                      0x00008000
#define _PMCON4_PTEN15_LENGTH                    0x00000001

#define _PMCS1CF_PTSZ_POSITION                   0x00000005
#define _PMCS1CF_PTSZ_MASK                       0x00000060
#define _PMCS1CF_PTSZ_LENGTH                     0x00000002

#define _PMCS1CF_ACKP_POSITION                   0x00000007
#define _PMCS1CF_ACKP_MASK                       0x00000080
#define _PMCS1CF_ACKP_LENGTH                     0x00000001

#define _PMCS1CF_SM_POSITION                     0x00000008
#define _PMCS1CF_SM_MASK                         0x00000100
#define _PMCS1CF_SM_LENGTH                       0x00000001

#define _PMCS1CF_RDSP_POSITION                   0x00000009
#define _PMCS1CF_RDSP_MASK                       0x00000200
#define _PMCS1CF_RDSP_LENGTH                     0x00000001

#define _PMCS1CF_WRSP_POSITION                   0x0000000A
#define _PMCS1CF_WRSP_MASK                       0x00000400
#define _PMCS1CF_WRSP_LENGTH                     0x00000001

#define _PMCS1CF_BEP_POSITION                    0x0000000C
#define _PMCS1CF_BEP_MASK                        0x00001000
#define _PMCS1CF_BEP_LENGTH                      0x00000001

#define _PMCS1CF_CSPTEN_POSITION                 0x0000000D
#define _PMCS1CF_CSPTEN_MASK                     0x00002000
#define _PMCS1CF_CSPTEN_LENGTH                   0x00000001

#define _PMCS1CF_CSP_POSITION                    0x0000000E
#define _PMCS1CF_CSP_MASK                        0x00004000
#define _PMCS1CF_CSP_LENGTH                      0x00000001

#define _PMCS1CF_CSDIS_POSITION                  0x0000000F
#define _PMCS1CF_CSDIS_MASK                      0x00008000
#define _PMCS1CF_CSDIS_LENGTH                    0x00000001

#define _PMCS1CF_PTSZ0_POSITION                  0x00000005
#define _PMCS1CF_PTSZ0_MASK                      0x00000020
#define _PMCS1CF_PTSZ0_LENGTH                    0x00000001

#define _PMCS1CF_PTSZ1_POSITION                  0x00000006
#define _PMCS1CF_PTSZ1_MASK                      0x00000040
#define _PMCS1CF_PTSZ1_LENGTH                    0x00000001

#define _PMCS1BS_BASE11_POSITION                 0x00000003
#define _PMCS1BS_BASE11_MASK                     0x00000008
#define _PMCS1BS_BASE11_LENGTH                   0x00000001

#define _PMCS1BS_BASE15_POSITION                 0x00000007
#define _PMCS1BS_BASE15_MASK                     0x00000080
#define _PMCS1BS_BASE15_LENGTH                   0x00000001

#define _PMCS1BS_BASE16_POSITION                 0x00000008
#define _PMCS1BS_BASE16_MASK                     0x00000100
#define _PMCS1BS_BASE16_LENGTH                   0x00000001

#define _PMCS1BS_BASE17_POSITION                 0x00000009
#define _PMCS1BS_BASE17_MASK                     0x00000200
#define _PMCS1BS_BASE17_LENGTH                   0x00000001

#define _PMCS1BS_BASE18_POSITION                 0x0000000A
#define _PMCS1BS_BASE18_MASK                     0x00000400
#define _PMCS1BS_BASE18_LENGTH                   0x00000001

#define _PMCS1BS_BASE19_POSITION                 0x0000000B
#define _PMCS1BS_BASE19_MASK                     0x00000800
#define _PMCS1BS_BASE19_LENGTH                   0x00000001

#define _PMCS1BS_BASE20_POSITION                 0x0000000C
#define _PMCS1BS_BASE20_MASK                     0x00001000
#define _PMCS1BS_BASE20_LENGTH                   0x00000001

#define _PMCS1BS_BASE21_POSITION                 0x0000000D
#define _PMCS1BS_BASE21_MASK                     0x00002000
#define _PMCS1BS_BASE21_LENGTH                   0x00000001

#define _PMCS1BS_BASE22_POSITION                 0x0000000E
#define _PMCS1BS_BASE22_MASK                     0x00004000
#define _PMCS1BS_BASE22_LENGTH                   0x00000001

#define _PMCS1BS_BASE23_POSITION                 0x0000000F
#define _PMCS1BS_BASE23_MASK                     0x00008000
#define _PMCS1BS_BASE23_LENGTH                   0x00000001

#define _PMCS1MD_DWAITE_POSITION                 0x00000000
#define _PMCS1MD_DWAITE_MASK                     0x00000003
#define _PMCS1MD_DWAITE_LENGTH                   0x00000002

#define _PMCS1MD_DWAITM_POSITION                 0x00000002
#define _PMCS1MD_DWAITM_MASK                     0x0000003C
#define _PMCS1MD_DWAITM_LENGTH                   0x00000004

#define _PMCS1MD_DWAITB_POSITION                 0x00000006
#define _PMCS1MD_DWAITB_MASK                     0x000000C0
#define _PMCS1MD_DWAITB_LENGTH                   0x00000002

#define _PMCS1MD_AMWAIT_POSITION                 0x0000000B
#define _PMCS1MD_AMWAIT_MASK                     0x00003800
#define _PMCS1MD_AMWAIT_LENGTH                   0x00000003

#define _PMCS1MD_ACKM_POSITION                   0x0000000E
#define _PMCS1MD_ACKM_MASK                       0x0000C000
#define _PMCS1MD_ACKM_LENGTH                     0x00000002

#define _PMCS1MD_DWAITE0_POSITION                0x00000000
#define _PMCS1MD_DWAITE0_MASK                    0x00000001
#define _PMCS1MD_DWAITE0_LENGTH                  0x00000001

